Revit 2024 API
Ellipse.XDirection Property
The X direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public XYZ XDirection { get; }
Visual Basic
Public ReadOnly Property XDirection As XYZ
	Get
Visual C++
public:
property XYZ^ XDirection {
	XYZ^ get ();
}
See Also
Ellipse Class
Autodesk.Revit.DB Namespace